# --- Инструкция по сборке приложения ---

# 1. Используем официальный образ Node.js в качестве основы
FROM node:18

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src/app

# 3. Копируем ВСЕ файлы проекта (и фронтенд, и бэкенд) внутрь контейнера
COPY . .

# 4. Переходим в папку с сервером и устанавливаем зависимости
WORKDIR /usr/src/app/server
RUN npm install

# 5. Возвращаемся в корневую директорию приложения
WORKDIR /usr/src/app

# 6. Указываем команду, которая будет запускать наш сервер
# Обратите внимание: мы запускаем index.js из папки server
CMD [ "node", "server/index.js" ]